import json

lst = [
    "Пирамида Джосера",
    "Пирамида Хеопса",
    "Большой сфинкс",
    "Солнечный храм Ниусерра",
    "Карнакский храм",
    "Кносский дворец",
    "Погребальный храм Хатшепсут",
    "Дворец Малката",
    "Поминальный храм Сети I",
    "Храм Весты",
    "Парфенон",
    "Храм Ники Аптерос",
    "Храм Портуна",
    "Вавилонская крепость",
    "Мавзолей Августа",
    "Театр Марцелла",
    "Колизей",
    "Траянов мост",
    "Форум Траяна",
    "Колонна Траяна",
    "Пантеон",
    "Арка Траяна",
    "Храм Антонина и Фаустины",
    "Термы Каракаллы",
    "Базилика Максенция-Константина"
]

cfg = []

for i in range(len(lst)):
    cfg.append({
        "id": i,
        "title": "Что это,?",
        "contentType": "image",
        "content": f"architecture/Pasted image ({i + 1}).png",
        "type": "one_choice",
        "answerSet": "name",
        "rightChoices": [i],
        "answerDesc": f"Это {lst[i]}"
    })

print(json.dumps(cfg))
